import re

# 1. Найти слова, начинающиеся на гласные буквы кириллицы.

s = '''Регулярные выражения (regular expressions) — формальный язык поиска и осуществления 
манипуляций с подстроками в тексте, основанный на использовании метасимволов (символов 
джокеров, wildcard characters).'''

pattern = r'((?<=\b)[еёюяаиоуыэ]\w*)'

res = re.findall(pattern, s, re.I)

print(', '.join(res)+'.\n')

# 2. Найти:
# числа в строке.
# отрицательные числа в строке.
# целые числа.
# неотрицательные целые числа.

numbers = '0 -1 87.0 66h 098 -88 ОДИН 6ОДИН -55.55 6451 -654 54'

res1 = re.findall(r"(?<!\w)(?!0[0-9])[-0-9.]+(?=\b)", numbers)
res2 = re.findall(r"(?<!\w)-(?!0[0-9])[0-9.]+(?=\b)", numbers)
res3 = re.findall(r"(?<![\w.])(?!0[0-9])[-0-9]+(?=\s)", numbers)
res4 = re.findall(r"(?<![\w.-])(?!0[0-9])[0-9]+(?=\s)", numbers)

print(', '.join(res1)+'.')
print(', '.join(res2)+'.')
print(', '.join(res3)+'.')
print(', '.join(res4)+'.')